src/test/resources/soap_requests/chargepoint.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:Username>DUMMY</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">DUMMY</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><S:Body><ns2:getStations xmlns:ns2="urn:dictionary:com.chargepoint.webservices"><searchQuery xmlns=""><orgID>1:ORG08313</orgID></searchQuery></ns2:getStations></S:Body></S:Envelope>